DataProcessors/ФормированиеСпискаОсновныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ФормированиеСпискаОсновныхСредств</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ПервоначальныеСведенияОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПервоначальныеСведенияОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение инвентарного номера ОС при передаче его из одной организации в другую. Информация записывается только документами ПринятиеКУчету по бух. виду учета и ввод остатков</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособПоступления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПоступленияАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособНачисленияАмортизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыНачисленияАмортизацииОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПараметрыВыработкиОС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестонахождениеОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МОЛ</Name>
					<Comment>Выбирается из списка регистра сведений "Работники организаций"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местонахождение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокПолезногоИспользования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПродукцииРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИспользованияДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъемПродукцииРаботДляВычисленияАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентАмортизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоэффициентУскорения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛиквидационнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НачислениеАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НачислениеАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает когда начислять амортизацию по бух. учету</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НачислятьАмортизацию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</Name>
			<Comment>(Регл) Регистр, который показывает изменение направлений амортизации по бух. учету</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияРасходовПоАмортизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияРасходовПоАмортизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СчетаУчетаОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СчетаУчетаОС</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизацииБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНДСПоПриобретению</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНДСПоРеализации</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНДСУплаченногоНаТаможне</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходовОтРеализацииБУ</Name>
					<Comment>Счет доходов от реализации</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетСебестоимостиПриРеализацииБУ</Name>
					<Comment>Счет отнесения себестоимости при реализации</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаЗатратПоМодернизацииБУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетУчетаНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетДоходовОтРеализацииНУ</Name>
					<Comment>Счет доходов от реализации</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетСебестоимостиПриРеализацииНУ</Name>
					<Comment>Счет отнесения себестоимости при реализации</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетНачисленияАмортизацииНУ</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Налоговый</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПоложительныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ</Name>
					<Comment>Счет положительных отклонений при передаче структурным подразделениям БУ</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетОтрицательныхОтклоненийПриПередачеСтруктурнымПодразделениямБУ</Name>
					<Comment>Счет отрицательных отклонений при передаче структурным подразделениям БУ</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыСостоянийОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыСостоянийОС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступило</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоКУчету</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятоСУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ФормированиеСпискаОсновныхСредств/Ext/ObjectModule.bsl
#Если Клиент Тогда

Процедура ЗаполнитьНачальныеНастройки(НачальноеЗаполнение = Истина) Экспорт

	// структура представлений полей
	СтруктураПредставлениеПолей = Новый Структура();
	СтруктураФорматаПолей = Новый Структура();
	
	ТекстЗапроса =
	"
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация КАК Организация,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.СпособНачисленияАмортизации,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ПервоначальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ПараметрВыработки КАК ПараметрВыработки
	|ПОМЕСТИТЬ ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних
	|ИЗ
	|	РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.СрезПоследних(&КонГраница, {(Организация).* КАК Организация, (ОсновноеСредство).* КАК ОсновноеСредство}) КАК ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Организация КАК Организация,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение КАК Местонахождение,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ КАК МОЛ,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.СтруктурноеПодразделение
	|ПОМЕСТИТЬ МестонахождениеОСБухгалтерскийУчетСрезПоследних
	|ИЗ
	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&КонГраница, {(Организация).* КАК Организация, (ОсновноеСредство).* КАК ОсновноеСредство}) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.Организация КАК Организация,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СтоимостьДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СрокИспользованияДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.КоэффициентАмортизации,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.КоэффициентУскорения
	|ПОМЕСТИТЬ ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|ИЗ
	|	РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.СрезПоследних(&КонГраница, {(Организация).* КАК Организация, (ОсновноеСредство).* КАК ОсновноеСредство}) КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НачислениеАмортизацииБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	НачислениеАмортизацииБухгалтерскийУчетСрезПоследних.Организация КАК Организация,
	|	НачислениеАмортизацииБухгалтерскийУчетСрезПоследних.НачислятьАмортизацию
	|ПОМЕСТИТЬ НачислениеАмортизацииБухгалтерскийУчетСрезПоследних
	|ИЗ
	|	РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.СрезПоследних(&КонГраница, {(Организация).* КАК Организация, (ОсновноеСредство).* КАК ОсновноеСредство}) КАК НачислениеАмортизацииБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.Организация КАК Организация,
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособОтраженияРасходовПоАмортизации
	|ПОМЕСТИТЬ СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних
	|ИЗ
	|	РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.СрезПоследних(&КонГраница, {(Организация).* КАК Организация, (ОсновноеСредство).* КАК ОсновноеСредство}) КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.Организация КАК Организация,
	|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетУчетаБУ,
	|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетНачисленияАмортизацииБУ
	|ПОМЕСТИТЬ СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних
	|ИЗ
	|	РегистрСведений.СчетаУчетаОС.СрезПоследних(&КонГраница, {(Организация).* КАК Организация, (ОсновноеСредство).* КАК ОсновноеСредство}) КАК СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних.Организация КАК Организация,
	|	ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних.ГрафикАмортизации
	|ПОМЕСТИТЬ ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних
	|ИЗ
	|	РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.СрезПоследних(&КонГраница, {(Организация).* КАК Организация, (ОсновноеСредство).* КАК ОсновноеСредство}) КАК ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство,
	|	СостоянияОСОрганизаций.Организация КАК Организация,
	|	МАКСИМУМ(СостоянияОСОрганизаций.ДатаСостояния) КАК ДатаСостояния
	|ПОМЕСТИТЬ ТекДатаСостояния
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(&ДатаОкончания) КАК СостоянияОСОрганизаций
	|{ГДЕ
	|	СостоянияОСОрганизаций.Организация.* КАК Организация,
	|	СостоянияОСОрганизаций.ОсновноеСредство.* КАК ОсновноеСредство}
	|
	|СГРУППИРОВАТЬ ПО
	|	СостоянияОСОрганизаций.ОсновноеСредство,
	|	СостоянияОСОрганизаций.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация,
	|	ДатаСостояния
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство,
	|	СостоянияОСОрганизаций.Организация КАК Организация,
	|	ТекДатаСостояния.ДатаСостояния КАК ДатаСостояния,
	|	МАКСИМУМ(СостоянияОСОрганизаций.Регистратор) КАК Регистратор
	|ПОМЕСТИТЬ ТекРегистратор
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций КАК СостоянияОСОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекДатаСостояния КАК ТекДатаСостояния
	|		ПО СостоянияОСОрганизаций.Организация = ТекДатаСостояния.Организация
	|			И СостоянияОСОрганизаций.ОсновноеСредство = ТекДатаСостояния.ОсновноеСредство
	|			И СостоянияОСОрганизаций.ДатаСостояния = ТекДатаСостояния.ДатаСостояния
	|
	|СГРУППИРОВАТЬ ПО
	|	СостоянияОСОрганизаций.ОсновноеСредство,
	|	СостоянияОСОрганизаций.Организация,
	|	ТекДатаСостояния.ДатаСостояния
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация,
	|	ДатаСостояния,
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостояниеОС.ОсновноеСредство КАК ОсновноеСредство,
	|	СостояниеОС.Организация КАК Организация,
	|	СостояниеОС.Состояние КАК Состояние,
	|	ТекРегистратор.ДатаСостояния КАК ДатаСостояния,
	|	СостояниеОС.Регистратор КАК ДокументУстановкиСостояния
	|ПОМЕСТИТЬ ТекущееСостояние
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций КАК СостояниеОС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТекРегистратор КАК ТекРегистратор
	|		ПО СостояниеОС.ОсновноеСредство = ТекРегистратор.ОсновноеСредство
	|			И СостояниеОС.Организация = ТекРегистратор.Организация
	|			И СостояниеОС.Регистратор = ТекРегистратор.Регистратор
	|			И СостояниеОС.ДатаСостояния = ТекРегистратор.ДатаСостояния
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СостоянияОСОрганизаций.ОсновноеСредство КАК ОсновноеСредство,
	|	СостоянияОСОрганизаций.ДатаСостояния КАК ДатаСостояния,
	|	СостоянияОСОрганизаций.Организация КАК Организация
	|ПОМЕСТИТЬ ПринятиеКУчету
	|ИЗ
	|	РегистрСведений.СостоянияОСОрганизаций.СрезПоследних(&ДатаОкончания) КАК СостоянияОСОрганизаций
	|ГДЕ
	|	СостоянияОСОрганизаций.Состояние = &СостояниеПринятоКУчету
	|{ГДЕ
	|	СостоянияОСОрганизаций.Организация.* КАК Организация,
	|	СостоянияОСОрганизаций.ОсновноеСредство.* КАК ОсновноеСредство}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОсновноеСредство,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство КАК ОсновноеСредство,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация КАК Организация,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение КАК Подразделение,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ИнвентарныйНомер КАК ИнвентарныйНомер,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.СпособНачисленияАмортизации,
	|	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СрокИспользованияДляВычисленияАмортизации,
	|	НачислениеАмортизацииБухгалтерскийУчетСрезПоследних.НачислятьАмортизацию,
	|	ТекущееСостояние.Состояние КАК ЗначениеТекущегоСостояния,
	|	ЕстьNull(ОбъектыИмущественногоНалогаСрезПоследних.НачислятьНалог, Ложь) КАК ОбъектИмущественногоНалога,
	|	ЕстьNull(ОбъектыЗемельногоНалогаСрезПоследних.НачислятьНалог, Ложь) КАК ОбъектЗемельногоНалога,
	|	ЕстьNull(ОбъектыТранспортногоНалогаСрезПоследних.НачислятьНалог, Ложь) КАК ОбъектТранспортногоНалога
	|{ВЫБРАТЬ
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение.* КАК Подразделение,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.СтруктурноеПодразделение.* КАК СтруктурноеПодразделение,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ.* КАК МОЛ,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство.*,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация.*,
	|	ПринятиеКУчету.ДатаСостояния КАК ДатаПринятияКУчету,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ИнвентарныйНомер,
	|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетУчетаБУ,
	|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетНачисленияАмортизацииБУ,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.СпособНачисленияАмортизации,
	|//	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СрокИспользованияДляВычисленияАмортизации,
	|//	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|//	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.КоэффициентАмортизации,
	|//	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.КоэффициентУскорения,
	|	ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних.ГрафикАмортизации.* КАК ГрафикАмортизации,
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособОтраженияРасходовПоАмортизации.* КАК СпособОтраженияРасходовПоАмортизации,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ПараметрВыработки.* КАК ПараметрВыработки,
	|	ЕстьNull(ОбъектыИмущественногоНалогаСрезПоследних.НачислятьНалог, Ложь) КАК ОбъектИмущественногоНалога,
	|	ЕстьNull(ОбъектыЗемельногоНалогаСрезПоследних.НачислятьНалог, Ложь) КАК ОбъектЗемельногоНалога,
	|	ЕстьNull(ОбъектыТранспортногоНалогаСрезПоследних.НачислятьНалог, Ложь) КАК ОбъектТранспортногоНалога
	|	//СВОЙСТВА
	|}
	|ИЗ
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних КАК ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ МестонахождениеОСБухгалтерскийУчетСрезПоследних КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
	|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = МестонахождениеОСБухгалтерскийУчетСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ НачислениеАмортизацииБухгалтерскийУчетСрезПоследних КАК НачислениеАмортизацииБухгалтерскийУчетСрезПоследних
	|		ПО (НачислениеАмортизацииБухгалтерскийУчетСрезПоследних.ОсновноеСредство = ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство)
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = НачислениеАмортизацииБухгалтерскийУчетСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних КАК ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних
	|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних КАК СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних
	|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних КАК СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних
	|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.ОсновноеСредство
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПринятиеКУчету КАК ПринятиеКУчету
	|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ПринятиеКУчету.ОсновноеСредство
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = ПринятиеКУчету.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущееСостояние КАК ТекущееСостояние
	|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ТекущееСостояние.ОсновноеСредство
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = ТекущееСостояние.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних КАК ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних
	|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних.ОсновноеСредство
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыЗемельногоНалога.СрезПоследних(&КонГраница,{(Налогоплательщик).* КАК Организация, (ОбъектНалогообложения).* КАК ОсновноеСредство}) ОбъектыЗемельногоНалогаСрезПоследних
	|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ОбъектыЗемельногоНалогаСрезПоследних.ОбъектНалогообложения
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = ОбъектыЗемельногоНалогаСрезПоследних.Налогоплательщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыИмущественногоНалога.СрезПоследних(&КонГраница,{(Налогоплательщик).* КАК Организация, (ОбъектНалогообложения).* КАК ОсновноеСредство}) ОбъектыИмущественногоНалогаСрезПоследних
	|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ОбъектыИмущественногоНалогаСрезПоследних.ОбъектНалогообложения
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = ОбъектыИмущественногоНалогаСрезПоследних.Налогоплательщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыТранспортногоНалога.СрезПоследних(&КонГраница,{(Налогоплательщик).* КАК Организация, (ОбъектНалогообложения).* КАК ОсновноеСредство}) ОбъектыТранспортногоНалогаСрезПоследних
	|		ПО ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство = ОбъектыТранспортногоНалогаСрезПоследних.ОбъектНалогообложения
	|			И ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация = ОбъектыТранспортногоНалогаСрезПоследних.Налогоплательщик
	|
	|{ГДЕ
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение.* КАК Подразделение,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.СтруктурноеПодразделение.* КАК СтруктурноеПодразделение,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ.* КАК МОЛ,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ОсновноеСредство.*,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.Организация.*,
	|	ПринятиеКУчету.ДатаСостояния КАК ДатаПринятияКУчету,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ИнвентарныйНомер,
	|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетУчетаБУ,
	|	СчетаБухгалтерскогоУчетаОсновныхСредствСрезПоследних.СчетНачисленияАмортизацииБУ,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.СпособНачисленияАмортизации,
	|//	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.СрокИспользованияДляВычисленияАмортизации,
	|//	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.ОбъемПродукцииРаботДляВычисленияАмортизации,
	|//	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.КоэффициентАмортизации,
	|//	ПараметрыАмортизацииОСБухгалтерскийУчетСрезПоследних.КоэффициентУскорения,
	|	ГрафикиАмортизацииБухгалтерскийУчетСрезПоследних.ГрафикАмортизации.* КАК ГрафикАмортизации,
	|	СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчетСрезПоследних.СпособОтраженияРасходовПоАмортизации.* КАК СпособОтраженияРасходовПоАмортизации,
	|	ТекущееСостояние.Состояние КАК ЗначениеТекущегоСостояния,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ПараметрВыработки.* КАК ПараметрВыработки,
	|	ЕстьNull(ОбъектыИмущественногоНалогаСрезПоследних.НачислятьНалог, Ложь) КАК ОбъектИмущественногоНалога,
	|	ЕстьNull(ОбъектыЗемельногоНалогаСрезПоследних.НачислятьНалог, Ложь) КАК ОбъектЗемельногоНалога,
	|	ЕстьNull(ОбъектыТранспортногоНалогаСрезПоследних.НачислятьНалог, Ложь) КАК ОбъектТранспортногоНалога
	|}
	|{УПОРЯДОЧИТЬ ПО
	|	ОсновноеСредство.*,
	|	ИнвентарныйНомер,
	|	Подразделение.*,
	|	СтруктурноеПодразделение.*,
	|	СпособНачисленияАмортизации.*,
	|	МОЛ.*,
	|	ПервоначальныеСведенияОбОсновныхСредствахОрганизацийСрезПоследних.ПараметрВыработки.*,
	|	СрокИспользованияДляВычисленияАмортизации,
	|	ПервоначальнаяСтоимость
	|	//СВОЙСТВА
	|}
	|";

	ПостроительОтчета.Текст = ТекстЗапроса;							  
	
	ПостроительОтчета.Параметры.Вставить( "ПустаяДата", '00010101');
	ПостроительОтчета.Параметры.Вставить( "СостояниеПринятоКУчету",	  Перечисления.ВидыСостоянийОС.ПринятоКУчету);
	ПостроительОтчета.Параметры.Вставить( "СостояниеСнятоСУчета", 	  Перечисления.ВидыСостоянийОС.СнятоСУчета);
	
	//представление полей запроса
	СтруктураПредставлениеПолей.Вставить( "ОсновноеСредство",          "Основное средство");
	
	СтруктураПредставлениеПолей.Вставить( "ДатаПринятияКУчету",        "Дата принятия к учету");
	СтруктураПредставлениеПолей.Вставить( "ДатаПоследнегоСостояния",   "Дата установки текущего состояния");
	СтруктураПредставлениеПолей.Вставить( "ЗначениеТекущегоСостояния", "Текущее состояние");
	
	СтруктураПредставлениеПолей.Вставить( "СчетУчетаБУ",                 "Счет учета");   
	СтруктураПредставлениеПолей.Вставить( "СчетНачисленияАмортизацииБУ", "Счет амортизации");
	
	СтруктураПредставлениеПолей.Вставить( "СпособНачисленияАмортизации", "Способ начисления амортизации");
	СтруктураПредставлениеПолей.Вставить( "СпособОтраженияРасходовПоАмортизации", "Отражение расходов");
	                                         
	СтруктураПредставлениеПолей.Вставить( "СрокИспользованияДляВычисленияАмортизации",   "Срок использования (для амортизации)");
	СтруктураПредставлениеПолей.Вставить( "ИнвентарныйНомер",                            "Инвентарный номер");
	СтруктураПредставлениеПолей.Вставить( "ОбъемПродукцииРаботДляВычисленияАмортизации", "Объем продукции");
	СтруктураПредставлениеПолей.Вставить( "КоэффициентАмортизации",                      "Коэффициент амортизации");
	СтруктураПредставлениеПолей.Вставить( "КоэффициентУскорения",                        "Коэффициент ускорения (для способа уменьшаемого остатака)");
	СтруктураПредставлениеПолей.Вставить( "ГрафикАмортизации",                           "Годовой график");
	СтруктураПредставлениеПолей.Вставить( "ПараметрВыработки",                           "Параметр выработки");
	
	СтруктураПредставлениеПолей.Вставить( "ОбъектИмущественногоНалога",  "Объект имущественного налога");
	СтруктураПредставлениеПолей.Вставить( "ОбъектЗемельногоНалога",      "Объект земельного налога");
	СтруктураПредставлениеПолей.Вставить( "ОбъектТранспортногоНалога",   "Объект транспортного налога");
	СтруктураПредставлениеПолей.Вставить( "СтруктурноеПодразделение",    "Структурное подразделение");
	
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	УправлениеОтчетами.УпорядочитьПоляПостроителяОтчета(ПостроительОтчета);
	
	// для поля ОсновноеСредство установим тип СправочникСсылка.ОсновныеСредства вместо составного типа
	ПолеОС = ПостроительОтчета.ДоступныеПоля.Найти("ОсновноеСредство");
	Если НЕ ПолеОС = Неопределено Тогда
		ПолеОС.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ОсновныеСредства");
	КонецЕсли;
	
	Если НачальноеЗаполнение Тогда
		// отборы по умолчанию
		МассивОтбора = Новый Массив;
		МассивОтбора.Добавить("Организация");
		УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	КонецЕсли;
	
КонецПроцедуры
	
Функция ПолучитьСписокРаботников() Экспорт
	
	ПостроительОтчета.Параметры.Вставить("ДатаОкончания", 			 КонецДня(ДатаАктуальности));
	ПостроительОтчета.Параметры.Вставить("Организация", 			 ПостроительОтчета.Отбор.Организация.Значение);
	ПостроительОтчета.Параметры.Вставить( "КонГраница", 			 Новый Граница(КонецДня(ДатаАктуальности), ВидГраницы.Включая));
	
	ПостроительОтчета.Выполнить();
	РезультатОтбора = ПостроительОтчета.Результат;
	Если РезультатОтбора.Пустой() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не обнаружено основных средств, удовлетворяющих указанным условиям!");
	КонецЕсли;
	
	Возврат Новый Структура("Команда, Данные", "ЗаполнитьСписокОС", РезультатОтбора);
	
КонецФункции

#КонецЕсли
